section "Entities Assets", ROM0

entities_tiles::
normal_penguin::
    db $0F,$0F,$10,$11,$0D,$12,$1F,$00,$1F,$05,$1F,$0F,$1F,$06,$3F,$20
    db $5F,$60,$9F,$E0,$7F,$60,$0F,$10,$0F,$10,$17,$18,$1B,$1C,$38,$38
    db $E0,$E0,$10,$F0,$C8,$38,$E8,$18,$E8,$18,$E8,$18,$C4,$3C,$E2,$1E
    db $E1,$1F,$F9,$0F,$F5,$0F,$F7,$0F,$F4,$0C,$F4,$1C,$F8,$38,$70,$70

jumping_penguin::
    db $0F,$0F,$10,$11,$0D,$12,$1F,$00,$1F,$05,$DF,$CF,$B9,$E1,$9F,$E6
    db $5F,$60,$3F,$20,$1F,$00,$0F,$10,$77,$78,$77,$78,$30,$30,$00,$00
    db $E0,$E0,$10,$F0,$C8,$38,$EB,$1B,$ED,$1F,$E9,$1F,$C1,$3F,$E2,$1E
    db $E4,$1C,$EC,$1C,$E4,$1C,$E4,$1C,$F4,$7C,$F8,$78,$30,$30,$00,$00

airship::
    db $03,$03,$EF,$EC,$9C,$F8,$DB,$F3,$7F,$6C,$78,$50,$7F,$7F,$78,$50
    db $7F,$6C,$DB,$F3,$9C,$F8,$EF,$EC,$03,$03,$02,$03,$02,$03,$01,$01
    db $F0,$F0,$F8,$08,$0C,$04,$F6,$F2,$FF,$0D,$07,$03,$FF,$FF,$07,$03
    db $FF,$0D,$F6,$F2,$0C,$04,$F8,$08,$F0,$F0,$10,$F0,$20,$E0,$C0,$C0

ghost_1::
    db $03,$03,$05,$04,$64,$64,$FA,$9A,$BA,$9A,$4A,$4A,$40,$40,$21,$21
    db $21,$21,$10,$10,$10,$10,$08,$08,$0E,$08,$04,$07,$03,$03,$01,$01
    db $C0,$C0,$E0,$20,$76,$16,$BD,$9B,$BD,$93,$BA,$96,$3A,$06,$34,$0C
    db $28,$18,$10,$30,$5E,$3E,$1D,$33,$1B,$07,$B4,$0C,$18,$F8,$E0,$E0

; (SU ANIMACIÓN SOLO CAMBIA EL TILE 4 POR ESO EN LA PARTE 2 SOLO VERÁS 
; 2 VRAM_TILE_DATA_START SUFICIENTES PARA PODER HACER SU SPRITE)
ghost_2::
    db $C0,$C0,$E0,$20,$76,$16,$BD,$9B,$BD,$93,$BA,$96,$3A,$06,$34,$0C
    db $28,$18,$10,$30,$56,$36,$1D,$3F,$1D,$03,$B2,$0E,$1C,$FC,$E0,$E0

; (ESTÁ COMPUESTO POR 2 SPRITES PERO SON SIMETRICOS POR LO QUE SOLO SE 
; ESCRIBEN DOS VRAM_TILE_DATA_START Y SE CREAN DOS,UNO DE ELLOS CON XFLIP,HAY 4 ANIMACIONES)
ovni_1::
    db $03,$03,$04,$07,$0B,$0C,$17,$18,$1F,$1F,$67,$78,$9F,$E0,$FF,$FF
    db $23,$3C,$1F,$1F,$07,$00,$0F,$00,$1F,$00,$3F,$00,$7F,$00,$FF,$00

ovni_2::
    db $03,$03,$04,$07,$0B,$0C,$17,$18,$1F,$1F,$67,$78,$9F,$E0,$FF,$FF
    db $23,$3C,$1F,$1F,$07,$00,$0F,$00,$1F,$00,$3F,$00,$00,$00,$00,$00

ovni_3::
    db $03,$03,$04,$07,$0B,$0C,$17,$18,$1F,$1F,$67,$78,$9F,$E0,$FF,$FF
    db $23,$3C,$1F,$1F,$07,$00,$0F,$00,$00,$00,$00,$00,$00,$00,$00,$00

ovni_4::
    db $03,$03,$04,$07,$0B,$0C,$17,$18,$1F,$1F,$67,$78,$9F,$E0,$FF,$FF
    db $23,$3C,$1F,$1F,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00,$00